In [ ]:
print(df)
print()
grouped=df.groupby("Age")["Salary"].sum()
print(grouped)
print()
grouped=df.groupby(["Age","Name"])["Salary"].sum()
print(grouped)

    Name    City  Age     DOB  Salary
0  Shree  Indore   18  2003.0   20000
1    Anu    None   22     NaN   10000
2    Ram    Dhar   13  1998.0   30000
3   Ritu    None   22  1995.0   44000
4   Gyan   Delhi   18  2000.0   23000

Age
13    30000
18    43000
22    54000
Name: Salary, dtype: int64

Age  Name
13   Ram      30000
18   Gyan     23000
     Shree    20000
22   Anu      10000
     Ritu     44000
Name: Salary, dtype: int64